---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams.ElasticModulusWeakAxis
source: html/186c1562-917a-ffaa-ebb4-9822fe7edb8b.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams.ElasticModulusWeakAxis Property

Elastic section modulus about main weak axis for calculation of bending stresses.

## Syntax (C#)
```csharp
public double ElasticModulusWeakAxis { get; set; }
```